package com.neusoft.exception;

/**
 * 自定义异常
 * 
 * @author sky
 * 
 *         示例：throw new MyException(10,"参数不正确");
 *
 *         (code, msg) <br/>
 *         (11, "添加新员工失败") <br/>
 *         (12, "添加新岗位失败") <br/>
 *         (13, "添加新部门失败") <br/>
 *         (14, "试用期信息录入失败") <br/>
 *         (15, "员工岗位调转信息录入失败") <br/>
 *         (16, "员工部门调转信息录入失败") <br/>
 *         (17, "员工离职信息录入失败") <br/>
 *         (18, "员工职业生涯信息录入失败") <br/>
 *         (19, "员工家庭成员及社会关系信息录入失败") <br/>
 *         (20, "员工外语能力信息录入失败") <br/>
 *         (21, "添加新用户失败") <br/>
 *         (22, "添加新角色失败") <br/>
 *         (23, "人才信息录入失败") <br/>
 *         (31, "修改员工基本信息失败") <br/>
 *         (32, "修改岗位失败") <br/>
 *         (33, "修改部门失败") <br/>
 *         (34, "试用期信息修改失败") <br/>
 *         (35, "员工岗位调转信息修改失败") <br/>
 *         (36, "员工部门调转信息修改失败") <br/>
 *         (37, "员工离职信息修改失败") <br/>
 *         (38, "员工职业生涯信息修改失败") <br/>
 *         (39, "员工家庭成员及社会关系信息修改失败") <br/>
 *         (40, "员工外语能力信息修改失败") <br/>
 *         (41, "修改用户失败") <br/>
 *         (42, "修改角色失败") <br/>
 *         (43, "修改人才信息失败") <br/>
 *         (51, "删除部门失败") <br/>
 *         (52, "删除岗位失败") <br/>
 *         (53, "删除用户失败") <br/>
 *         (54, "删除角色失败") <br/>
 *         (55, "删除人才信息失败") <br/>
 *         (61, "查询部门列表失败") <br/>
 *         (62, "查询岗位列表失败") <br/>
 *         (63, "已调动部门员工信息查询失败") <br/>
 *         (64, "已调动岗位员工信息查询失败")<br/>
 *         (65, "已离职员工信息查询失败") <br/>
 *         (66, "已转正员工信息查询失败") <br/>
 *         (67, "试用期员工列表查询失败") <br/>
 *         (68, "通用员工列表查询失败") <br/>
 *         (69, "查询用户列表失败") <br/>
 *         (70, "查询角色表失败") <br/>
 *         (70, "查询员工外语能力信息失败") <br/>
 *         (71, "查询员工家庭成员及社会关系信息失败") <br/>
 *         (72, "查询职业生涯信息失败") <br/>
 *         (73, "查询人才信息失败") <br/>
 *         (81,"登录失败")
 * 
 *
 * 
 */
public class MyException extends Exception {

	private Integer code;
	private String msg;

	public MyException(Integer code, String msg) {

		this.code = code;
		this.msg = msg;

	}

	public Integer getCode() {
		return code;
	}

	public void setCode(Integer code) {
		this.code = code;
	}

	public String getMsg() {
		return msg;
	}

	public void setMsg(String msg) {
		this.msg = msg;
	}

}
